{'story_metadata': {'story_id': 'US-060', 'elaboration_date': '2025-01-15', 'development_readiness': 'Complete'}, 'story_narrative': {'title': 'Access and search a digital rulebook from game menus', 'as_a_user_story': 'As a player, I want to open a searchable digital rulebook from both the main menu and the in-game pause menu so that I can quickly find and clarify specific game rules without leaving the application.', 'user_persona': 'Any player, from a novice learning the basics to an expert clarifying an edge-case rule.', 'business_value': 'Improves user experience by providing immediate, in-game access to rules, reducing player friction and confusion. Reinforces game authenticity and polish, leading to higher player satisfaction and retention.', 'functional_area': 'User Interface & Player Support', 'story_theme': 'Player Onboarding and Assistance'}, 'acceptance_criteria': [{'criteria_id': 'AC-001', 'scenario': 'Accessing the rulebook from the in-game pause menu', 'scenario_type': 'Happy_Path', 'given': 'a player is in an active game and is able to pause the game', 'when': "the player opens the pause menu and clicks the 'Rulebook' button", 'then': 'the rulebook UI is displayed as a modal overlay, the game in the background is paused, and the full list of rules is visible and scrollable.'}, {'criteria_id': 'AC-002', 'scenario': 'Accessing the rulebook from the main menu', 'scenario_type': 'Happy_Path', 'given': 'the player is on the main menu screen', 'when': "the player clicks the 'Rulebook' button", 'then': 'the rulebook UI is displayed, showing the full list of rules.'}, {'criteria_id': 'AC-003', 'scenario': 'Searching for a specific rule with results', 'scenario_type': 'Happy_Path', 'given': 'the rulebook UI is open', 'when': "the player types a keyword (e.g., 'mortgage') into the search bar", 'then': "the list of rules is dynamically filtered to show only the sections and entries containing the keyword 'mortgage', and the keyword is visually highlighted in the results."}, {'criteria_id': 'AC-004', 'scenario': 'Clearing the search returns to the full list', 'scenario_type': 'Happy_Path', 'given': 'the rulebook is open and a search filter is currently active', 'when': 'the player clears all text from the search bar', 'then': 'the filter is removed and the complete, unfiltered list of all rules is displayed.'}, {'criteria_id': 'AC-005', 'scenario': 'Closing the rulebook while in-game', 'scenario_type': 'Happy_Path', 'given': 'the player has opened the rulebook from the in-game pause menu', 'when': "the player clicks the 'Close' button or presses the 'Escape' key", 'then': 'the rulebook UI closes and the player is returned to the pause menu, with the game remaining paused.'}, {'criteria_id': 'AC-006', 'scenario': 'Searching for a term with no results', 'scenario_type': 'Alternative_Flow', 'given': 'the rulebook UI is open', 'when': "the player types a term that does not exist in the rules (e.g., 'xyz')", 'then': "the rule list becomes empty and a clear message, such as 'No results found', is displayed."}, {'criteria_id': 'AC-007', 'scenario': 'Rulebook content is loaded from an external file', 'scenario_type': 'Happy_Path', 'given': 'the game is launched', 'when': 'the player opens the rulebook', 'then': 'the content displayed is sourced from the structured JSON data file as specified in SRS 8.7.2, not hardcoded in the application.'}, {'criteria_id': 'AC-008', 'scenario': 'Handling a missing or corrupt rulebook data file', 'scenario_type': 'Error_Condition', 'given': "the rulebook's source JSON file is missing or malformed", 'when': 'the player attempts to open the rulebook from any menu', 'then': "a user-friendly error message is displayed (e.g., 'Rulebook data could not be loaded.'), the rulebook UI does not open, and an ERROR is written to the log file."}], 'user_interface_requirements': {'ui_elements': ["A 'Rulebook' button on the main menu and in-game pause menu.", 'A modal or full-screen overlay for the rulebook.', 'A text input field for search.', 'A scrollable content area to display rules.', 'A navigation pane or clickable table of contents for rule sections.', "A 'Close' button (e.g., 'X' icon) and/or support for the 'Escape' key to close."], 'user_interactions': ['Search results must update in real-time as the user types (with a minor debounce to prevent performance issues).', 'Clicking on a section in the table of contents should instantly scroll the view to that section.', 'The search term should be highlighted in the search results to be easily identifiable.'], 'display_requirements': ['Must clearly display rule titles and body text.', "Must display a 'No results found' message when a search yields no matches."], 'accessibility_needs': ['Text must have sufficient contrast against the background.', 'The interface should be navigable using a keyboard (tabbing between elements, enter to select, escape to close).']}, 'business_rules': [{'rule_id': 'BR-001', 'rule_description': 'Rulebook content must be sourced from an external structured data file (JSON) to facilitate updates and localization, as per SRS 8.7.2 and 8.7.3.', 'enforcement_point': 'During the rulebook initialization/loading process.', 'violation_handling': 'If the file is not found or is invalid, the feature should fail gracefully with a user message and an error log, as per AC-008.'}, {'rule_id': 'BR-002', 'rule_description': 'The game simulation must be fully paused when the rulebook is open during a match.', 'enforcement_point': 'When the rulebook UI is activated from the pause menu.', 'violation_handling': 'Game timers, animations, and AI processing must be suspended. The game state must not change while the rulebook is open.'}], 'dependencies': {'prerequisite_stories': [{'story_id': 'US-054', 'dependency_reason': 'This story requires the existence of an in-game pause menu to provide an access point during gameplay.'}, {'story_id': 'US-008', 'dependency_reason': 'This story requires the existence of a main menu to provide an access point before a game starts.'}], 'technical_dependencies': ["Unity's UI system (or equivalent) for creating the interface.", 'System.Text.Json library for parsing the rulebook data file.', 'A robust game state manager to handle pausing and resuming the game.'], 'data_dependencies': ['A finalized, structured JSON file containing the complete and accurate text of the official Monopoly rules. The schema for this file must be defined before development begins.'], 'external_dependencies': []}, 'non_functional_requirements': {'performance': ['The rulebook UI must load and appear within 1 second of being clicked.', 'Search filtering must complete and update the UI within 200ms of the last keystroke on recommended hardware.'], 'security': ['The JSON parsing logic must be secure against potential injection attacks if the file were to be maliciously modified, though the risk is low for a local file.'], 'usability': ['The layout must be intuitive, with the search bar being the most prominent interactive element.', 'Scrolling should be smooth and responsive.'], 'accessibility': ['Must adhere to WCAG 2.1 AA standards for color contrast.', 'Full keyboard navigation must be supported.'], 'compatibility': ['The UI must scale correctly across all supported aspect ratios (16:9, 16:10, 21:9) without breaking the layout, as per SRS 2.5.']}, 'implementation_considerations': {'complexity_assessment': 'Medium', 'complexity_factors': ['Developing a polished and responsive UI with real-time search filtering and highlighting.', 'Defining a robust and flexible JSON schema for the rulebook content.', "Ensuring seamless integration with the game's pause/resume state machine.", 'Implementing robust error handling for the external data file.'], 'technical_risks': ['Poor search performance on large rule sets if not implemented efficiently.', 'The game state might not pause/resume correctly, leading to bugs if the integration with the game loop is not handled carefully.'], 'integration_points': ['Main Menu UI.', 'In-Game Pause Menu UI.', 'Game State Manager (for pausing/resuming).', 'Logging System (for file I/O errors).']}, 'testing_requirements': {'testing_types': ['Unit', 'Integration', 'E2E'], 'test_scenarios': ['Verify access from both main and pause menus.', 'Test search functionality with various keywords, including those that yield results, no results, and partial matches.', 'Test UI behavior when clearing the search bar.', 'Confirm game state is properly paused and resumed when accessed in-game.', 'Test graceful failure when the rulebook JSON file is deleted, renamed, or corrupted.'], 'test_data_needs': ['A complete rulebook JSON file.', 'A malformed/corrupt version of the JSON file to test error handling.', 'An empty JSON file.'], 'testing_tools': ['NUnit for unit tests.', 'Unity Test Framework for integration tests.']}, 'definition_of_done': ['All acceptance criteria validated and passing', 'Code reviewed and approved by at least one other developer', 'Unit tests for search logic and JSON parsing implemented with >80% coverage and passing', 'Integration testing for pause/resume functionality completed successfully', 'User interface reviewed and approved for usability and adherence to design', 'Performance requirements for search speed and UI loading verified', 'Error handling for missing/corrupt data file is confirmed to work as expected', 'Documentation for the rulebook JSON schema is created', 'Story deployed and verified in the staging environment'], 'planning_information': {'story_points': '5', 'priority': 'Medium', 'sprint_considerations': ['The task of creating the rulebook JSON content can be done in parallel with development once the schema is defined. This content creation task should be tracked separately.', 'Requires collaboration between development and design/UX to finalize the UI layout.'], 'release_impact': 'This is a significant quality-of-life feature. Its absence would not block a release, but its inclusion greatly enhances the perceived quality and completeness of the product.'}}