{'story_metadata': {'story_id': 'US-002', 'elaboration_date': '2025-01-15', 'development_readiness': 'Complete'}, 'story_narrative': {'title': 'Choose a custom installation directory', 'as_a_user_story': 'As a Windows PC user installing the game, I want to be able to choose a custom installation directory so that I can manage my disk space and organize my installed applications according to my personal preferences.', 'user_persona': 'A Windows PC user with specific preferences for software organization or disk space management.', 'business_value': 'Meets standard user expectations for PC software installation, improving user experience and perceived product quality. Allows users with limited primary drive space (e.g., small SSDs) to install the game on larger secondary drives.', 'functional_area': 'Installation and Distribution', 'story_theme': 'Game Installation Experience'}, 'acceptance_criteria': [{'criteria_id': 'AC-001', 'scenario': 'Select a custom installation directory on a different drive', 'scenario_type': 'Happy_Path', 'given': "The user is running the game installer and has reached the 'Choose Install Location' screen", 'when': "The user clicks the 'Browse...' button, selects a valid directory on a different drive (e.g., 'D:\\Games'), and proceeds with the installation", 'then': "The installer successfully installs all game files into the 'D:\\Games\\MonopolyTycoon' directory and the installation completes without errors."}, {'criteria_id': 'AC-002', 'scenario': 'Create a new folder during directory selection', 'scenario_type': 'Happy_Path', 'given': "The user is on the 'Choose Install Location' screen", 'when': "The user clicks 'Browse...', navigates to a parent directory (e.g., 'D:\\My Games'), uses the 'Make New Folder' option to create 'Monopoly Tycoon', selects it, and proceeds", 'then': "The installer correctly installs the game into the newly created 'D:\\My Games\\Monopoly Tycoon' directory."}, {'criteria_id': 'AC-003', 'scenario': 'Installer displays required and available disk space', 'scenario_type': 'Happy_Path', 'given': "The user is on the 'Choose Install Location' screen", 'when': 'The user views the screen or selects a different drive', 'then': 'The UI accurately displays the total disk space required for the game and the available disk space on the currently selected drive, updating dynamically when the drive is changed.'}, {'criteria_id': 'AC-004', 'scenario': 'Attempt to install on a drive with insufficient space', 'scenario_type': 'Error_Condition', 'given': "The user is on the 'Choose Install Location' screen", 'when': 'The user selects a directory on a drive where the available space is less than the required space', 'then': "The installer displays a clear error message stating 'Insufficient disk space' and the 'Next' or 'Install' button is disabled until a valid location with enough space is selected."}, {'criteria_id': 'AC-005', 'scenario': 'Attempt to install in a restricted or write-protected directory', 'scenario_type': 'Error_Condition', 'given': "The user is on the 'Choose Install Location' screen", 'when': "The user attempts to select a directory for which they do not have write permissions (e.g., 'C:\\Windows\\System32')", 'then': 'The installer displays an error message indicating that the selected location is not writable or is protected, and prevents the user from proceeding.'}, {'criteria_id': 'AC-006', 'scenario': 'Proceeding with the default installation path', 'scenario_type': 'Alternative_Flow', 'given': "The user is on the 'Choose Install Location' screen, where a default path is displayed (e.g., 'C:\\Program Files\\MonopolyTycoon')", 'when': "The user does not change the directory and clicks 'Next' or 'Install'", 'then': 'The game is installed correctly into the default system-provided directory.'}], 'user_interface_requirements': {'ui_elements': ['A text input field displaying the current installation path.', "A 'Browse...' or 'Change...' button next to the path input field.", "A text label displaying 'Space required: X GB'.", "A text label displaying 'Space available: Y GB' for the selected drive."], 'user_interactions': ["Clicking the 'Browse...' button opens a native Windows folder selection dialog.", 'The path in the text field is updated upon selection of a new folder.', "The 'Space available' text updates dynamically when the target drive changes."], 'display_requirements': ['The installer must clearly show the default installation path.', 'Error messages for invalid paths or insufficient space must be user-friendly and clearly state the problem.'], 'accessibility_needs': ['All UI elements (buttons, text fields) must be keyboard-navigable (e.g., using Tab key).', 'Labels must be correctly associated with their respective controls.']}, 'business_rules': [{'rule_id': 'BR-001', 'rule_description': 'The selected installation location must be writable by the current user.', 'enforcement_point': 'Upon confirming the selected directory and before file writing begins.', 'violation_handling': 'Display an error message and halt the installation process, returning the user to the directory selection screen.'}, {'rule_id': 'BR-002', 'rule_description': 'The selected drive must have sufficient free space to accommodate the full game installation.', 'enforcement_point': 'On the directory selection screen, validated when a directory is selected.', 'violation_handling': "Display a warning and disable the 'Next' button until a location with sufficient space is chosen."}], 'dependencies': {'prerequisite_stories': [{'story_id': 'US-001', 'dependency_reason': 'This story defines a feature within the installer created by US-001. The core installer framework must exist first.'}], 'technical_dependencies': ['Inno Setup scripting environment, as specified in SRS section 2.2.'], 'data_dependencies': [], 'external_dependencies': []}, 'non_functional_requirements': {'performance': ['The disk space check should complete in under 1 second after selecting a new drive.'], 'security': ['The installer must not require elevated (Administrator) privileges unless necessary to write to the selected directory (e.g., Program Files).'], 'usability': ['The process must follow standard conventions for Windows installers to be immediately familiar to users.'], 'accessibility': ['The installer UI should adhere to Windows accessibility guidelines.'], 'compatibility': ['The installer must function correctly on all target OS versions: Windows 10 (64-bit) and Windows 11 (64-bit).']}, 'implementation_considerations': {'complexity_assessment': 'Low', 'complexity_factors': ['This is a standard, built-in feature of Inno Setup.', 'Implementation primarily involves configuring the Inno Setup script (.iss file) to use the `SelectDir` page type.', 'Requires adding simple validation logic for disk space, which is also a standard Inno Setup function.'], 'technical_risks': ["Incorrect script configuration could lead to the installer ignoring the user's choice, but this is easily detectable in testing."], 'integration_points': ['The selected directory path variable must be correctly passed to the `[Files]` and `[Icons]` sections of the Inno Setup script.']}, 'testing_requirements': {'testing_types': ['Manual E2E Testing'], 'test_scenarios': ['Verify installation to default path.', 'Verify installation to custom path on the same drive.', 'Verify installation to custom path on a different drive.', 'Verify installation to a path containing spaces.', 'Verify installation to a network drive.', 'Verify error handling for insufficient disk space.', 'Verify error handling for write-protected/restricted folders.', 'Verify functionality on both Windows 10 and Windows 11.'], 'test_data_needs': ['A test environment (VM or physical) with multiple partitions/drives.', 'One drive must be configured to have less free space than the game requires.'], 'testing_tools': ['Virtualization software (e.g., VMware, VirtualBox) to test on clean OS installations.']}, 'definition_of_done': ['All acceptance criteria validated and passing', 'Code (Inno Setup script) reviewed and approved by team', 'Unit tests implemented and passing', 'The installer has been successfully built with the new functionality', 'Manual end-to-end testing completed successfully on all target platforms', 'User interface reviewed and approved', 'Performance requirements verified', 'Security requirements validated', 'Documentation updated appropriately', 'The final installer package is available and verified in a shared location for release.'], 'planning_information': {'story_points': '1', 'priority': 'High', 'sprint_considerations': ["This is a foundational feature for the game's distribution and should be completed early in the development cycle, likely in the first sprint alongside US-001."], 'release_impact': ['Critical for the V1.0 release. A PC application without this feature would be considered incomplete and unprofessional.']}}