{'story_metadata': {'story_id': 'US-007', 'elaboration_date': '2025-01-15', 'development_readiness': 'Complete'}, 'story_narrative': {'title': 'Choose to keep my personal data upon uninstallation', 'as_a_user_story': 'As a Windows PC Gamer who needs to uninstall the game, I want to be given a clear choice to keep or delete my personal game data (like save files and player profile) during the uninstallation process so that I can reinstall the game later without losing all my progress and achievements.', 'user_persona': 'Any user of Monopoly Tycoon on Windows who has generated personal data (profiles, save games, statistics) and is now uninstalling the application.', 'business_value': "Improves user satisfaction and increases the likelihood of player retention by removing the friction of starting over. This respects the user's time investment and aligns with industry best practices for desktop applications.", 'functional_area': 'Installation and System Management', 'story_theme': 'Player Experience and Data Management'}, 'acceptance_criteria': [{'criteria_id': 'AC-001', 'scenario': 'User chooses to keep personal data during uninstallation', 'scenario_type': 'Happy_Path', 'given': "the game is installed and the user has created personal data located in the '%APPDATA%/MonopolyTycoon' directory", 'when': "the user runs the uninstaller and selects 'No' at the prompt asking to remove personal data", 'then': "the application files and shortcuts are completely removed, but the '%APPDATA%/MonopolyTycoon' directory and all its contents remain untouched.", 'validation_notes': "Verify the installation directory is empty or deleted. Verify the '%APPDATA%/MonopolyTycoon' directory still contains the user's save files and SQLite database."}, {'criteria_id': 'AC-002', 'scenario': 'User chooses to delete personal data during uninstallation', 'scenario_type': 'Happy_Path', 'given': "the game is installed and the user has created personal data located in the '%APPDATA%/MonopolyTycoon' directory", 'when': "the user runs the uninstaller and selects 'Yes' at the prompt asking to remove personal data", 'then': "the application files and shortcuts are completely removed, AND the '%APPDATA%/MonopolyTycoon' directory and all its contents are also deleted.", 'validation_notes': "Verify the installation directory is empty or deleted. Verify the '%APPDATA%/MonopolyTycoon' directory no longer exists."}, {'criteria_id': 'AC-003', 'scenario': 'Uninstallation when no personal data exists', 'scenario_type': 'Edge_Case', 'given': "the game is installed but has never been run, so no '%APPDATA%/MonopolyTycoon' directory has been created", 'when': 'the user runs the uninstaller', 'then': 'the uninstallation process completes successfully without presenting a prompt to remove personal data.', 'validation_notes': 'Run the uninstaller on a fresh installation. Confirm that no dialog regarding personal data appears and the application is removed cleanly.'}, {'criteria_id': 'AC-004', 'scenario': 'User is presented with a clear and understandable prompt', 'scenario_type': 'Happy_Path', 'given': 'the user is uninstalling the game and personal data exists', 'when': 'the uninstaller displays the prompt for data removal', 'then': "the dialog text explicitly mentions that 'personal data' includes save games, player profiles, and statistics, and the default selected button is 'No' (to keep data).", 'validation_notes': "Visually inspect the uninstaller dialog to confirm the text content and that the 'No' button has focus or is the default action."}, {'criteria_id': 'AC-005', 'scenario': 'User cancels the uninstallation at the data removal prompt', 'scenario_type': 'Alternative_Flow', 'given': 'the user has initiated the uninstallation process and is presented with the data removal prompt', 'when': "the user closes the uninstaller window or clicks a 'Cancel' button", 'then': 'the uninstallation process is aborted, and no files (neither application files nor personal data) are removed.', 'validation_notes': 'Start the uninstallation, cancel at the prompt, and then verify that the game is still installed and all personal data is intact.'}], 'user_interface_requirements': {'ui_elements': ['A modal confirmation dialog within the Inno Setup uninstaller.', "Dialog must contain a 'Yes' button and a 'No' button."], 'user_interactions': ['The user must actively choose to delete their data; the default, safer option is to keep it.', "The 'No' button should be the default selection to prevent accidental data loss."], 'display_requirements': ["Dialog Title: 'Remove Personal Data?' or similar.", "Dialog Message: 'Do you want to remove all your personal data, including save games, player profiles, and statistics? If you plan to reinstall Monopoly Tycoon later, you should choose No.'"], 'accessibility_needs': ['The dialog and its options should be navigable using standard keyboard controls (Tab, Enter, Spacebar).']}, 'business_rules': [{'rule_id': 'BR-001', 'rule_description': "User-specific data must be stored in the user's application data directory (%APPDATA%) and not in the installation folder.", 'enforcement_point': 'During game installation and at runtime when creating/saving files.', 'violation_handling': 'N/A - This is a design constraint for other stories that this story relies upon.'}, {'rule_id': 'BR-002', 'rule_description': 'The uninstallation process must provide a clean removal of the application, leaving no orphaned files or registry entries, except for user data if explicitly requested.', 'enforcement_point': 'During the uninstallation process.', 'violation_handling': 'The uninstaller script must be designed to clean up all created files and registry keys.'}], 'dependencies': {'prerequisite_stories': [{'story_id': 'US-001', 'dependency_reason': 'An uninstaller is created as part of the installation process. This story modifies that uninstaller.'}, {'story_id': 'US-011', 'dependency_reason': 'This story defines the creation of player profiles, which is part of the personal data to be managed.'}, {'story_id': 'US-061', 'dependency_reason': 'This story defines the creation of save game files, which is part of the personal data to be managed.'}], 'technical_dependencies': ['Inno Setup scripting language (Pascal Script) is required to implement the custom uninstaller logic.', "The location of user data is defined as '%APPDATA%/MonopolyTycoon' in SRS sections 3.3, 9.1.1, and 13.4."], 'data_dependencies': ["Depends on the existence of save files (JSON) and a statistics database (SQLite) in the user's data directory to trigger the prompt."], 'external_dependencies': []}, 'non_functional_requirements': {'performance': ['The uninstallation process, including the prompt, should be responsive and complete within a reasonable time frame (e.g., under 30 seconds).'], 'security': ['The uninstaller must run with appropriate permissions to remove application files but should not require elevated privileges just to check for the user data directory.'], 'usability': ['The prompt must be clear, unambiguous, and default to the least destructive action (keeping the data).'], 'accessibility': ['The uninstaller dialog must adhere to Windows UI standards for keyboard navigation.'], 'compatibility': ['The uninstaller must function correctly on all target Windows OS versions (Windows 10 and 11, 64-bit).']}, 'implementation_considerations': {'complexity_assessment': 'Low', 'complexity_factors': ['Requires scripting within the Inno Setup (.iss) file.', "Logic involves checking for a directory's existence, displaying a conditional message box, and conditionally deleting a directory.", "Developer familiarity with Inno Setup's Pascal Scripting will affect effort."], 'technical_risks': ['Incorrectly implemented script could fail to delete data when requested, or delete it when not requested.', 'Hardcoding paths instead of using Inno Setup constants (e.g., {userappdata}) could lead to failures on different system configurations.'], 'integration_points': ["This feature is integrated directly into the application's uninstaller, which is generated by the Inno Setup compiler."]}, 'testing_requirements': {'testing_types': ['Manual', 'E2E'], 'test_scenarios': ["Test Case 1: Install, create data, uninstall, choose 'No', verify data remains.", "Test Case 2: Install, create data, uninstall, choose 'Yes', verify data is deleted.", 'Test Case 3: Install, do not run, uninstall, verify no prompt appears.', 'Test Case 4: Re-install after Test Case 1, verify old data is loaded and usable.', 'Test Case 5: Start uninstall, cancel at the prompt, verify application and data are untouched.'], 'test_data_needs': ['A state where the game has been played to generate a player profile, statistics, and at least one save game file.'], 'testing_tools': ['A clean virtual machine (e.g., Hyper-V, VirtualBox) is recommended for repeated install/uninstall testing.']}, 'definition_of_done': ['All acceptance criteria validated and passing', 'Inno Setup script changes are peer-reviewed and merged', 'Manual E2E testing of all scenarios has been completed and passed on a target Windows OS', 'The uninstaller successfully removes all application files and registry keys as intended', "The user data is correctly handled (kept or deleted) according to the user's choice", 'The installer package has been rebuilt with the updated uninstaller logic'], 'planning_information': {'story_points': '2', 'priority': 'Medium', 'sprint_considerations': ['This is a good story to pair with other installer/deployment tasks.', 'Should be scheduled after the core features for creating profiles and saving games are complete.'], 'release_impact': ['This is a quality-of-life feature expected in modern desktop applications. Its absence could be noted in user reviews. Essential for a polished 1.0 release.']}}