{'story_metadata': {'story_id': 'US-047', 'elaboration_date': '2025-01-24', 'development_readiness': 'Complete'}, 'story_narrative': {'title': 'See a game-over screen when I go bankrupt', 'as_a_user_story': "As a human player, I want to be shown a clear 'Game Over' screen immediately after I am declared bankrupt, so that I understand I have lost the game and am no longer an active participant.", 'user_persona': 'The human player of Monopoly Tycoon.', 'business_value': "Provides clear, unambiguous feedback on the player's loss condition, which is essential for a complete and satisfying game loop. This prevents player confusion and frustration, reinforcing the game's rules and structure.", 'functional_area': 'Game Flow & End Conditions', 'story_theme': 'Player Game Experience'}, 'acceptance_criteria': [{'criteria_id': 'AC-001', 'scenario': 'Display of Game Over Screen upon Bankruptcy', 'scenario_type': 'Happy_Path', 'given': 'the human player is in an active game and incurs a debt they cannot pay after liquidating all assets (selling buildings and mortgaging properties)', 'when': "the system's bankruptcy logic declares the human player bankrupt", 'then': "the main game view is immediately replaced by a modal 'Game Over' screen."}, {'criteria_id': 'AC-002', 'scenario': 'Content of the Game Over Screen', 'scenario_type': 'Happy_Path', 'given': "the 'Game Over' screen is displayed", 'when': 'the player views the screen', 'then': "the screen must contain a prominent header text like 'Game Over' or 'You Are Bankrupt'", 'and': "it must contain a single, clear call-to-action button labeled 'View Game Summary'."}, {'criteria_id': 'AC-003', 'scenario': 'Proceeding from Game Over to AI Simulation', 'scenario_type': 'Happy_Path', 'given': "the human player is viewing the 'Game Over' screen and more than one AI opponent remains in the game", 'when': "the player clicks the 'View Game Summary' button", 'then': "a high-speed simulation of the remaining AI players' turns begins", 'and': 'the application UI remains responsive and does not freeze.'}, {'criteria_id': 'AC-004', 'scenario': 'Transition to Summary Screen after Simulation', 'scenario_type': 'Happy_Path', 'given': 'the high-speed AI simulation is running', 'when': 'the simulation concludes with a single AI winner', 'then': "the game automatically transitions to the final 'Game Summary' screen (as defined in US-048)."}, {'criteria_id': 'AC-005', 'scenario': 'Bankruptcy with Only One AI Opponent Remaining', 'scenario_type': 'Edge_Case', 'given': 'the human player is in a game with only one AI opponent remaining', 'when': "the human player is declared bankrupt and clicks the 'View Game Summary' button on the 'Game Over' screen", 'then': "the game immediately transitions to the 'Game Summary' screen without running a simulation phase."}, {'criteria_id': 'AC-006', 'scenario': 'Game Controls Disabled on Game Over Screen', 'scenario_type': 'Error_Condition', 'given': "the 'Game Over' screen is displayed", 'when': 'the player attempts to interact with any background game elements or use keyboard shortcuts', 'then': "no action occurs, and the only interactive element is the 'View Game Summary' button."}], 'user_interface_requirements': {'ui_elements': ["A modal dialog or full-screen overlay for the 'Game Over' screen.", "Large header text (e.g., 'GAME OVER').", "Sub-header text for player rank (e.g., 'You finished 3rd').", "A single button ('View Game Summary').", 'A visual indicator for the high-speed simulation phase.'], 'user_interactions': ["The player's only available action on the 'Game Over' screen is to click the single button to proceed.", 'All other game interactions (e.g., property management, settings menu) must be disabled.'], 'display_requirements': ["The screen's visual theme should clearly communicate a loss (e.g., using darker, more subdued colors compared to the victory screen).", 'The final player rank must be calculated correctly based on the number of players at the start of the game.'], 'accessibility_needs': ['Text must have sufficient contrast against the background.', 'The button must be keyboard-navigable and activatable via Enter/Space keys.']}, 'business_rules': [{'rule_id': 'BR-001', 'rule_description': "The game must continue simulating AI turns after the human player's bankruptcy to determine the final winner and rankings for statistical purposes.", 'enforcement_point': "After the human player acknowledges the 'Game Over' screen.", 'violation_handling': "If simulation fails, the game should still proceed to the summary screen with the data available at the time of the human player's bankruptcy."}], 'dependencies': {'prerequisite_stories': [{'story_id': 'US-045', 'dependency_reason': 'Bankruptcy is often triggered by the inability to pay rent.'}, {'story_id': 'US-038', 'dependency_reason': 'Mortgaging is a required step in asset liquidation before bankruptcy can be declared.'}, {'story_id': 'US-048', 'dependency_reason': "This story's flow concludes by transitioning to the Game Summary screen, which must exist."}], 'technical_dependencies': ["A robust 'Bankruptcy Detection Module' that accurately determines when a player is bankrupt according to official rules (SRS 7.1).", "The 'Game State Manager' to update the human player's status to 'Bankrupt'.", "The 'Game Loop Controller' to support a high-speed, no-animation simulation mode."], 'data_dependencies': ['Requires access to the current game state to determine the number of active players for ranking.'], 'external_dependencies': []}, 'non_functional_requirements': {'performance': ["The transition from the game board to the 'Game Over' screen must occur in under 500ms.", 'The high-speed AI simulation should not cause the application UI to become unresponsive.'], 'security': [], 'usability': ["The 'Game Over' message must be clear, concise, and unambiguous.", "The player's next action must be obvious and guided by a single call-to-action."], 'accessibility': ['The screen must adhere to WCAG 2.1 AA standards for color contrast and keyboard navigation.'], 'compatibility': []}, 'implementation_considerations': {'complexity_assessment': 'Medium', 'complexity_factors': ['The primary complexity lies in implementing the high-speed AI simulation mode. This requires decoupling the game logic from UI animations and player input prompts.', 'Ensuring the simulation runs efficiently and terminates correctly without getting into an infinite loop.', 'Dependency on a fully functional and accurate bankruptcy detection system.'], 'technical_risks': ['The AI simulation logic could be resource-intensive or contain bugs that lead to incorrect outcomes or application freezes.', 'Incorrect state management during the transition from player loss to AI simulation could corrupt the final game statistics.'], 'integration_points': ['Integrates with the Bankruptcy Detection Module (receives bankruptcy event).', 'Integrates with the UI Manager (triggers screen transition).', 'Integrates with the Game Loop Controller (initiates simulation mode).', 'Integrates with the Game Summary screen (navigates to it upon completion).']}, 'testing_requirements': {'testing_types': ['Unit', 'Integration', 'E2E'], 'test_scenarios': ['Verify the Game Over screen appears when bankrupting to another player.', 'Verify the Game Over screen appears when bankrupting to the Bank.', 'Verify the simulation runs correctly when 3 AI players are remaining.', 'Verify the game transitions directly to the summary screen when only 1 AI player is remaining.', 'Verify the final player rank is calculated correctly in 2, 3, and 4-player games.'], 'test_data_needs': ['Pre-configured saved game state files where the human player is one move away from unavoidable bankruptcy.', 'A saved game state with only the human player and one AI remaining.'], 'testing_tools': ['NUnit for unit tests.', 'A test harness to load specific game states for integration and E2E testing.']}, 'definition_of_done': ['All acceptance criteria validated and passing', 'Code reviewed and approved by at least one other developer', "Unit tests for the screen's logic are written and achieve >80% coverage", 'Integration tests for the bankruptcy-to-summary-screen flow are implemented and passing', 'The high-speed AI simulation is verified to complete correctly and without performance degradation', "UI/UX for the 'Game Over' screen and simulation indicator has been reviewed and approved by the design lead", 'Story has been successfully tested against all required test scenarios', 'No new high-priority bugs have been introduced', 'Story deployed and verified in the staging environment'], 'planning_information': {'story_points': '5', 'priority': 'High', 'sprint_considerations': ['This story is dependent on the completion of the core bankruptcy logic. It should be scheduled in a sprint after that logic is stable.', 'Should be planned in the same sprint as US-048 (Game Summary Screen) to ensure a complete end-of-game user flow.'], 'release_impact': 'Critical for the Minimum Viable Product (MVP). The game is not considered feature-complete without a clear loss condition screen.'}}