{
  "rules": [
    {
      "id": "section_1",
      "title": "Object of the Game",
      "content": "The object of the game is to become the wealthiest player through buying, renting and selling property."
    },
    {
      "id": "section_2",
      "title": "Playing the Game",
      "content": "On your turn, roll two dice and move your token clockwise that number of spaces. Take action depending on the space you land on. If you roll doubles, you take another turn after your first one is complete. Roll three consecutive doubles, and you go to Jail."
    },
    {
      "id": "section_3",
      "title": "Buying Property",
      "content": "If you land on an unowned property, you may buy it from the Bank. If you decline to buy it, the Banker must immediately auction it to the highest bidder."
    },
    {
      "id": "section_4",
      "title": "Jail",
      "content": "You go to Jail if you land on the 'Go to Jail' space, draw a card that says so, or roll three consecutive doubles. To get out, you can pay a $50 fine, use a 'Get Out of Jail Free' card, or attempt to roll doubles on one of your next three turns."
    },
    {
      "id": "section_5",
      "title": "Building Houses",
      "content": "Once you own all properties in a color group (a monopoly), you may buy houses from the Bank to place on them. You must build evenly; you cannot build a second house on one property until you have built one on all properties in that group."
    },
    {
      "id": "section_6",
      "title": "Building Hotels",
      "content": "When a player has four houses on each property of a complete color-group, they may buy a hotel from the Bank and erect it on any property of that color-group. They return the four houses from that property to the Bank."
    },
    {
      "id": "section_7",
      "title": "Mortgages",
      "content": "Undeveloped properties can be mortgaged through the Bank at any time. The mortgage value is printed on each Title Deed card. To lift the mortgage, the owner must pay the Bank the amount of the mortgage plus 10% interest."
    },
    {
      "id": "section_8",
      "title": "Bankruptcy",
      "content": "A player is bankrupt if they owe more than they can pay. If your debt is to another player, you must turn over all that you have of value to that player. If your debt is to the Bank, the Bank auctions off all of your properties."
    }
  ]
}